colintrachte/QR-Provisioning-ESP32/src-d1/main_d1mini.cpp
/**
 * src-d1/main.cpp — RC Tank firmware for Wemos D1 Mini (ESP8266).
 *
 * Build:    pio run -e d1_mini -t upload
 * Web UI:   pio run -e d1_mini -t uploadfs
 * Monitor:  pio device monitor -e d1_mini
 *
 * Shares data/ (index.html / style.css / script.js) with the S3 target.
 * Shared drive logic lives in shared/drive_mixer.h.
 *
 * Pinout (Wemos D1 Mini)
 * ─────────────────────────────────────────────────────────────────────────────
 *   Left  forward   D1  GPIO 5
 *   Left  reverse   D2  GPIO 4
 *   Right forward   D5  GPIO 14
 *   Right reverse   D6  GPIO 12
 *   Reset / reprov  D3  GPIO 0   FLASH button — hold 3 s on boot
 *   Onboard LED         GPIO 2   Active LOW. Shared with UART TX — expect
 *                                flicker on serial output. This is normal.
 *
 * Motor wiring note
 * ─────────────────────────────────────────────────────────────────────────────
 * The left motor on this board is physically wired so that "forward" on the
 * H-bridge drives the track backward relative to the chassis. DRIVE_LEFT_SIGN
 * compensates without touching the mixer math. If your wiring differs, flip
 * DRIVE_LEFT_SIGN or DRIVE_RIGHT_SIGN in the defines below.
 *
 * LED quirks vs S3 target
 * ─────────────────────────────────────────────────────────────────────────────
 * S3:  LEDC PWM, active HIGH, FreeRTOS software timer drives pattern tick.
 * D1:  analogWrite() PWM (10-bit), active LOW (duty must be inverted),
 *      Ticker drives pattern tick from an os_timer ISR.
 *
 *      CRITICAL: analogWrite() is not ISR-safe on ESP8266 — it calls into
 *      the PWM driver with interrupts enabled and will crash if called from
 *      the Ticker callback. The pattern tick therefore only sets a flag;
 *      ledApply() is called from loop() to do the actual analogWrite().
 *      This adds at most one loop() latency (~few ms) which is imperceptible
 *      for blink patterns.
 *
 * Differences from S3 target
 * ─────────────────────────────────────────────────────────────────────────────
 *   No OLED, no QR codes, no LEDC peripheral.
 *   Credentials stored in LittleFS JSON instead of NVS.
 *   ESPAsyncWebServer instead of esp_http_server.
 *   mDNS via ESP8266mDNS (requires MDNS.update() in loop).
 *   Telemetry: sends left/right track state + rssi. No battery/temp on bare
 *   D1 Mini — add an ADC voltage divider and the i_battery equivalent if needed.
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <DNSServer.h>
#include <ESPAsyncWebServer.h>
#include <LittleFS.h>
#include <Ticker.h>

/* Sign convention for this board's motor wiring. See header for explanation. */
#define DRIVE_LEFT_SIGN  -1
#define DRIVE_RIGHT_SIGN  1
#include "../../shared/drive_mixer.h"

/* ── Identity ────────────────────────────────────────────────────────────────*/
static constexpr char HOSTNAME[]   = "rc-tank";
static constexpr char AP_SSID[]    = "RC-Tank-Setup";
static constexpr char CREDS_FILE[] = "/wifi.json";

/* ── Pinout ──────────────────────────────────────────────────────────────────*/
static constexpr uint8_t LEFT_FWD  = D1;   /* GPIO 5  */
static constexpr uint8_t LEFT_REV  = D2;   /* GPIO 4  */
static constexpr uint8_t RIGHT_FWD = D5;   /* GPIO 14 */
static constexpr uint8_t RIGHT_REV = D6;   /* GPIO 12 */
static constexpr uint8_t RESET_BTN = D3;   /* GPIO 0 — FLASH button, active LOW */
static constexpr uint8_t LED_PIN   = 2;    /* GPIO 2 — active LOW, shared with TX */

/* ── Tuning ──────────────────────────────────────────────────────────────────*/
static constexpr int          MAX_PWM       = 1023;
static constexpr int          PWM_DEADBAND  = 20;
static constexpr int          RAMP_STEP     = 40;
static constexpr int          DIR_LOCK_PWM  = 80;

static constexpr unsigned long MOTOR_TICK_MS = 20;
static constexpr unsigned long TELEMETRY_MS  = 200;   /* 5 Hz — matches S3 */
static constexpr unsigned long WATCHDOG_MS   = 400;   /* matches S3 DRIVE_WATCHDOG_MS */
static constexpr unsigned long CLEANUP_MS    = 5000;
static constexpr unsigned long MDNS_TICK_MS  = 100;
static constexpr unsigned long RESET_HOLD_MS = 3000;

/* ═════════════════════════════════════════════════════════════════════════════
 *  LED — pattern engine
 *
 *  Mirrors the S3's o_led.c patterns exactly. Ticker fires every 50 ms from
 *  an os_timer ISR to advance the step counter and compute the next duty
 *  value, but does NOT call analogWrite(). The pending duty is written to
 *  s_led_pending_duty and a flag is set. loop() calls ledApply() which does
 *  the actual analogWrite() in normal (non-ISR) context.
 *
 *  Active-LOW inversion: duty 0 = full brightness, 1023 = off.
 *  LED_DUTY(n) converts a 0–1023 "logical brightness" to the inverted value.
 * ═════════════════════════════════════════════════════════════════════════════*/

enum class LedPattern : uint8_t {
    OFF,
    ON,
    SLOW_BLINK,    /*  1 Hz  — booting / disarmed          */
    FAST_BLINK,    /*  5 Hz  — connecting                   */
    DOUBLE_BLINK,  /* two pulses then dark — error / e-stop */
    HEARTBEAT,     /* long on + dim echo — running / armed  */
};

#define LED_FULL  1023
#define LED_DIM   341    /* ~1/3 of full — matches S3's DUTY_MAX/3 */
#define LED_OFF_V 0      /* logical off → inverted to 1023 at write */

/* Active-LOW inversion applied at write time, not in the pattern table. */
#define LED_INVERT(duty)  (LED_FULL - (duty))

static volatile LedPattern s_led_pattern = LedPattern::OFF;
static volatile int        s_led_step    = 0;
static volatile int        s_led_duty    = 0;   /* logical 0–1023; inverted on write */
static volatile bool       s_led_dirty   = false;

static Ticker s_led_ticker;

/* Called from Ticker ISR — no analogWrite(), only arithmetic and flag. */
static void IRAM_ATTR ledTick()
{
    LedPattern pat  = s_led_pattern;
    int        step = s_led_step;
    int        duty = 0;

    switch (pat) {
    case LedPattern::OFF:
        duty = 0;
        break;

    case LedPattern::ON:
        duty = LED_FULL;
        break;

    case LedPattern::SLOW_BLINK:
        /* 1 Hz: 10 ticks on (500 ms), 10 ticks off */
        duty = (step < 10) ? LED_FULL : 0;
        s_led_step = (step + 1) % 20;
        break;

    case LedPattern::FAST_BLINK:
        /* 5 Hz: 2 ticks on (100 ms), 2 ticks off */
        duty = (step < 2) ? LED_FULL : 0;
        s_led_step = (step + 1) % 4;
        break;

    case LedPattern::DOUBLE_BLINK:
        /* Two short pulses then dark — 20-tick (1 s) cycle */
        if      (step < 2)  duty = LED_FULL;
        else if (step < 4)  duty = 0;
        else if (step < 6)  duty = LED_FULL;
        else                duty = 0;
        s_led_step = (step + 1) % 20;
        break;

    case LedPattern::HEARTBEAT:
        /* Long on, brief off, dim pulse, off — 20-tick (1 s) cycle.
         * Matches the S3 pattern: running / armed indicator. */
        if      (step < 14) duty = LED_FULL;
        else if (step < 16) duty = 0;
        else if (step < 18) duty = LED_DIM;
        else                duty = 0;
        s_led_step = (step + 1) % 20;
        break;
    }

    s_led_duty  = duty;
    s_led_dirty = true;
}

/* Call from loop() — safe to call analogWrite() here. */
static void ledApply()
{
    if (!s_led_dirty) return;
    s_led_dirty = false;
    analogWrite(LED_PIN, LED_INVERT(s_led_duty));
}

/* Public-facing LED API — mirrors o_led.h interface names. */

/* Set a continuous brightness (0.0 = off, 1.0 = full).
 * Stops any running pattern. Step reset before pattern change — same
 * write-order discipline as the S3 to avoid stale step with new pattern. */
static void ledSet(float brightness)
{
    brightness = constrain(brightness, 0.0f, 1.0f);
    s_led_step    = 0;
    s_led_pattern = LedPattern::OFF;
    /* Write duty directly; bypass ISR path for immediate effect. */
    analogWrite(LED_PIN, LED_INVERT((int)(brightness * LED_FULL)));
}

static void ledBlink(LedPattern pattern)
{
    s_led_step    = 0;   /* reset before pattern — same order as S3 */
    s_led_pattern = pattern;
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  MOTOR
 * ═════════════════════════════════════════════════════════════════════════════*/

enum class DriveState : uint8_t { STOPPED, RAMP_UP, RUNNING };

struct Motor {
    const uint8_t pinFwd;
    const uint8_t pinRev;
    int        pwm     = 0;
    int        target  = 0;
    bool       forward = true;
    DriveState state   = DriveState::STOPPED;
};

static Motor s_left  = { LEFT_FWD,  LEFT_REV  };
static Motor s_right = { RIGHT_FWD, RIGHT_REV };

