colintrachte/QR-Provisioning-ESP32/src-d1/main_d1mini.cpp
static void motorWrite(const Motor &m)
{
    if (m.state == DriveState::STOPPED) {
        analogWrite(m.pinFwd, 0);
        analogWrite(m.pinRev, 0);
    } else if (m.forward) {
        analogWrite(m.pinFwd, m.pwm);
        analogWrite(m.pinRev, 0);
    } else {
        analogWrite(m.pinFwd, 0);
        analogWrite(m.pinRev, m.pwm);
    }
}

static void motorTick(Motor &m)
{
    if (m.target < PWM_DEADBAND) {
        m.pwm   = 0;
        m.state = DriveState::STOPPED;
    } else if (m.state == DriveState::STOPPED) {
        m.state = DriveState::RAMP_UP;
        m.pwm   = 0;
    } else if (m.state == DriveState::RAMP_UP) {
        m.pwm = min(m.pwm + RAMP_STEP, m.target);
        if (m.pwm >= m.target) m.state = DriveState::RUNNING;
    } else {
        m.pwm = m.target;
    }
    motorWrite(m);
}

/* Direction reversal blocked above DIR_LOCK_PWM to protect H-bridge. */
static void motorSetDuty(Motor &m, float duty)
{
    const bool want_fwd = (duty >= 0.0f);
    const int  mag      = min((int)(fabsf(duty) * MAX_PWM), MAX_PWM);

    if (want_fwd != m.forward && m.pwm > DIR_LOCK_PWM) return;

    m.forward = want_fwd;
    m.target  = mag;

    if (mag < PWM_DEADBAND)
        m.state = DriveState::STOPPED;
    else if (m.state == DriveState::STOPPED)
        m.state = DriveState::RAMP_UP;
}

static void hardStop()
{
    s_left.target  = s_right.target = 0;
    s_left.pwm     = s_right.pwm    = 0;
    s_left.state   = s_right.state  = DriveState::STOPPED;
    motorWrite(s_left);
    motorWrite(s_right);
}

static void applyAxes(float x, float y)
{
    drive_out_t out = drive_mix(x, y);
    motorSetDuty(s_left,  out.left);
    motorSetDuty(s_right, out.right);
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  GLOBAL STATE
 * ═════════════════════════════════════════════════════════════════════════════*/

static bool          s_armed          = false;
static bool          s_provisioning   = false;
static bool          s_watchdog_fired = false;
static unsigned long s_last_command   = 0;
static unsigned long s_reboot_at      = 0;

static unsigned long s_last_motor   = 0;
static unsigned long s_last_telem   = 0;
static unsigned long s_last_cleanup = 0;
static unsigned long s_last_mdns    = 0;

static AsyncWebServer s_http(80);
static AsyncWebSocket s_ws("/ws");
static DNSServer      s_dns;

/* ═════════════════════════════════════════════════════════════════════════════
 *  CREDENTIALS  (LittleFS JSON: {"s":"ssid","p":"pass"})
 * ═════════════════════════════════════════════════════════════════════════════*/

static bool parseCreds(const String &json, String &ssid, String &pass)
{
    int si = json.indexOf("\"s\":\"");
    int pi = json.indexOf("\"p\":\"");
    if (si < 0 || pi < 0) return false;
    si += 5; int se = json.indexOf('"', si);
    pi += 5; int pe = json.indexOf('"', pi);
    if (se < 0 || pe < 0) return false;
    ssid = json.substring(si, se);
    pass = json.substring(pi, pe);
    return ssid.length() > 0;
}

static bool loadCreds(String &ssid, String &pass)
{
    if (!LittleFS.exists(CREDS_FILE)) return false;
    File f = LittleFS.open(CREDS_FILE, "r");
    if (!f) return false;
    String json = f.readString();
    f.close();
    return parseCreds(json, ssid, pass);
}

static void saveCreds(const String &ssid, const String &pass)
{
    File f = LittleFS.open(CREDS_FILE, "w");
    if (!f) return;
    f.print("{\"s\":\""); f.print(ssid);
    f.print("\",\"p\":\""); f.print(pass);
    f.print("\"}");
    f.close();
    Serial.printf("Credentials saved: %s\n", ssid.c_str());
}

static void clearCreds()
{
    LittleFS.remove(CREDS_FILE);
    Serial.println("Credentials cleared");
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  WEBSOCKET DISPATCH
 * ═════════════════════════════════════════════════════════════════════════════*/

static const char *driveStateName(DriveState s)
{
    switch (s) {
        case DriveState::STOPPED: return "STOPPED";
        case DriveState::RAMP_UP: return "RAMP_UP";
        case DriveState::RUNNING: return "RUNNING";
        default:                  return "UNKNOWN";
    }
}

static void broadcastTelemetry()
{
    if (s_ws.count() == 0) return;

    /* Flat JSON + left/right track objects. script.js uses track objects when
     * present (D1 Mini path) and falls back to local axis math when absent
     * (S3 path, unless S3 health_monitor is extended to emit them too). */
    char buf[220];
    snprintf(buf, sizeof(buf),
        "{"
        "\"rssi\":%d,"
        "\"left\":{\"speed\":%d,\"state\":\"%s\",\"forward\":%s},"
        "\"right\":{\"speed\":%d,\"state\":\"%s\",\"forward\":%s}"
        "}",
        (int)WiFi.RSSI(),
        s_left.pwm,  driveStateName(s_left.state),  s_left.forward  ? "true" : "false",
        s_right.pwm, driveStateName(s_right.state), s_right.forward ? "true" : "false");

    s_ws.textAll(buf);
}

static void handleMessage(AsyncWebSocketClient *client, const char *msg)
{
    drive_cmd_t cmd;
    if (!drive_parse(msg, &cmd)) {
        Serial.printf("WS unknown: %s\n", msg);
        return;
    }

    /* Every recognised message resets the watchdog — same policy as S3. */
    s_last_command   = millis();
    s_watchdog_fired = false;

    switch (cmd.type) {
        case DRIVE_CMD_PING:
            client->text("pong");
            break;

        case DRIVE_CMD_ARM:
            s_armed = true;
            ledBlink(LedPattern::HEARTBEAT);
            Serial.println("ARMED");
            break;

        case DRIVE_CMD_DISARM:
            s_armed = false;
            hardStop();
            ledBlink(LedPattern::SLOW_BLINK);
            Serial.println("DISARMED");
            break;

        case DRIVE_CMD_STOP:
            hardStop();
            break;

        case DRIVE_CMD_AXES:
            if (s_armed) applyAxes(cmd.x, cmd.y);
            break;

        case DRIVE_CMD_LED:
            /* UI sends joystick magnitude as LED brightness — use it as-is.
             * Active-LOW inversion is handled inside ledSet(). */
            ledSet(cmd.led);
            break;

        default:
            break;
    }
}

static void onWsEvent(AsyncWebSocket *, AsyncWebSocketClient *client,
                      AwsEventType type, void *arg, uint8_t *data, size_t len)
{
    switch (type) {
        case WS_EVT_CONNECT:
            Serial.printf("WS client #%u connected\n", client->id());
            s_last_command   = millis();
            s_watchdog_fired = false;
            ledBlink(LedPattern::SLOW_BLINK);   /* client connected but not yet armed */
            break;

        case WS_EVT_DISCONNECT:
            Serial.printf("WS client #%u disconnected\n", client->id());
            s_armed = false;
            hardStop();
            /* If no clients remain, go back to slow blink (idle/connected state).
             * If clients remain (multi-browser), keep current pattern. */
            if (s_ws.count() == 0)
                ledBlink(LedPattern::SLOW_BLINK);
            break;

        case WS_EVT_DATA: {
            const auto *info = reinterpret_cast<AwsFrameInfo *>(arg);
            if (info->opcode != WS_TEXT || len == 0) break;
            data[len] = '\0';
            handleMessage(client, reinterpret_cast<char *>(data));
            break;
        }

        default:
            break;
    }
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  PROVISIONING MODE
 * ═════════════════════════════════════════════════════════════════════════════*/

static void startProvisioningMode()
{
    s_provisioning = true;
    Serial.printf("AP: %s (open)\n", AP_SSID);
    ledBlink(LedPattern::FAST_BLINK);   /* "connecting / setup" indicator */

    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(AP_SSID);
    delay(100);

