colintrachte/QR-Provisioning-ESP32/src-d1/main_d1mini.cpp
    WiFi.scanNetworksAsync([](int n) {
        Serial.printf("Initial scan: %d networks\n", n);
    }, false);

    s_dns.start(53, "*", WiFi.softAPIP());
    Serial.printf("AP IP: %s\n", WiFi.softAPIP().toString().c_str());

    /* OS captive-portal probes */
    s_http.on("/ncsi.txt",                  HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/plain", "Microsoft Connect Test"); });
    s_http.on("/connecttest.txt",           HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/plain", "Microsoft Connect Test"); });
    s_http.on("/redirect",                  HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/plain", "Microsoft Connect Test"); });
    s_http.on("/hotspot-detect.html",       HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/html",  "<HTML><BODY>Success</BODY></HTML>"); });
    s_http.on("/library/test/success.html", HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/html",  "<HTML><BODY>Success</BODY></HTML>"); });
    s_http.on("/generate_204",              HTTP_GET, [](AsyncWebServerRequest *r){ r->send(204); });
    s_http.on("/gen_204",                   HTTP_GET, [](AsyncWebServerRequest *r){ r->send(204); });
    s_http.on("/success.txt",               HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200, "text/plain", "success"); });

    s_http.on("/scan", HTTP_GET, [](AsyncWebServerRequest *req) {
        int n = WiFi.scanComplete();
        if (n == WIFI_SCAN_RUNNING) {
            req->send(202, "application/json", "{\"status\":\"scanning\"}");
            return;
        }
        if (n <= 0) {
            WiFi.scanNetworksAsync([](int n){ Serial.printf("Rescan: %d\n", n); }, false);
            req->send(202, "application/json", "{\"status\":\"scanning\"}");
            return;
        }
        String json = "[";
        for (int i = 0; i < n; i++) {
            if (i > 0) json += ",";
            String ssid = WiFi.SSID(i);
            ssid.replace("\\", "\\\\");
            ssid.replace("\"", "\\\"");
            int q = constrain(2 * (WiFi.RSSI(i) + 100), 0, 100);
            json += "{\"ssid\":\"" + ssid + "\""
                  + ",\"quality\":"  + String(q)
                  + ",\"secure\":"   + (WiFi.encryptionType(i) != ENC_TYPE_NONE ? "true" : "false")
                  + "}";
        }
        json += "]";
        WiFi.scanDelete();
        WiFi.scanNetworksAsync([](int){}, false);
        req->send(200, "application/json", json);
    });

    s_http.on("/save", HTTP_POST, [](AsyncWebServerRequest *req) {
        if (!req->hasParam("ssid", true)) { req->send(400, "text/plain", "Missing SSID"); return; }
        String ssid = req->getParam("ssid", true)->value();
        String pass = req->hasParam("pass", true) ? req->getParam("pass", true)->value() : "";
        ssid.trim();
        if (ssid.length() == 0) { req->send(400, "text/plain", "SSID empty"); return; }
        saveCreds(ssid, pass);
        s_reboot_at = millis() + 1200;
        req->send(200, "text/plain", "Saved. Rebooting...");
    });

    s_http.onNotFound([](AsyncWebServerRequest *req) {
        req->redirect("http://192.168.4.1/setup.html");
    });

    s_http.serveStatic("/", LittleFS, "/").setDefaultFile("setup.html");
    s_http.begin();
    Serial.println("Provisioning server ready");
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  NORMAL OPERATION
 * ═════════════════════════════════════════════════════════════════════════════*/

static void startNormalMode(const String &ssid, const String &pass)
{
    ledBlink(LedPattern::FAST_BLINK);   /* "connecting" — same as S3 */
    Serial.printf("Connecting to %s", ssid.c_str());

    WiFi.mode(WIFI_STA);
    WiFi.hostname(HOSTNAME);
    WiFi.begin(ssid, pass);

    const unsigned long deadline = millis() + 15000;
    while (WiFi.status() != WL_CONNECTED && millis() < deadline) {
        ledApply();   /* service LED while blocking — keeps pattern alive */
        delay(50);
        if (millis() % 250 < 50) Serial.print('.');
    }

    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("\nWiFi failed — clearing credentials");
        ledBlink(LedPattern::DOUBLE_BLINK);
        clearCreds();
        startProvisioningMode();
        return;
    }

    Serial.printf("\nIP: %s\n", WiFi.localIP().toString().c_str());
    ledBlink(LedPattern::SLOW_BLINK);   /* connected, no client yet */

    if (MDNS.begin(HOSTNAME)) {
        MDNS.addService("http", "tcp", 80);
        MDNS.addService("ws",   "tcp", 80);
        Serial.printf("mDNS: http://%s.local\n", HOSTNAME);
    } else {
        Serial.println("mDNS failed — still reachable by IP");
    }

    s_ws.onEvent(onWsEvent);
    s_http.addHandler(&s_ws);
    s_http.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
    s_http.begin();

    s_last_command = millis();
    Serial.println("HTTP + WebSocket ready");
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  RESET BUTTON  (hold FLASH/D3 for RESET_HOLD_MS on boot)
 * ═════════════════════════════════════════════════════════════════════════════*/

static void checkResetButton()
{
    if (digitalRead(RESET_BTN) == HIGH) return;

    Serial.print("Reset held — hold for 3 s to clear credentials...");
    const unsigned long start = millis();
    while (digitalRead(RESET_BTN) == LOW) {
        unsigned long held = millis() - start;
        if (held >= RESET_HOLD_MS) {
            Serial.println(" done.");
            clearCreds();
            ledSet(1.0f);   /* solid on while erasing — matches S3 behaviour */
            return;
        }
        /* Fast blink during hold for visual feedback. Drive it directly here
         * since the Ticker hasn't started yet at this point in boot. */
        digitalWrite(LED_PIN, (held / 100) % 2 == 0 ? LOW : HIGH);
        delay(50);
    }
    digitalWrite(LED_PIN, HIGH);   /* off */
    Serial.println(" released early — cancelled");
}

/* ═════════════════════════════════════════════════════════════════════════════
 *  ARDUINO ENTRY POINTS
 * ═════════════════════════════════════════════════════════════════════════════*/

void setup()
{
    Serial.begin(74880);
    Serial.println("\n\nRC Tank (D1 Mini) booting...");

    /* Motor pins */
    for (uint8_t pin : { LEFT_FWD, LEFT_REV, RIGHT_FWD, RIGHT_REV })
        pinMode(pin, OUTPUT);
    hardStop();

    /* LED — configure before Ticker starts so the pin is in a known state.
     * pinMode OUTPUT is required; without it analogWrite() on GPIO2 has no
     * effect on some ESP8266 SDK versions. Start with LED off (HIGH). */
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, HIGH);

    /* Reprovision button */
    pinMode(RESET_BTN, INPUT);

    /* Start LED pattern ticker now — patterns will be visible during WiFi
     * init. 50 ms period matches the S3's FreeRTOS timer interval. */
    s_led_ticker.attach_ms(50, ledTick);
    ledBlink(LedPattern::SLOW_BLINK);   /* "booting" — same as S3 */

