colintrachte/QR-Provisioning-ESP32/src-d1/main_d1mini.cpp
    if (!LittleFS.begin()) {
        Serial.println("LittleFS mount failed — halting");
        ledBlink(LedPattern::DOUBLE_BLINK);
        return;
    }

    checkResetButton();

    String ssid, pass;
    if (loadCreds(ssid, pass))
        startNormalMode(ssid, pass);
    else
        startProvisioningMode();
}

void loop()
{
    /* Apply any pending LED duty change from the Ticker ISR. Must be first
     * so patterns stay responsive even when other work takes time. */
    ledApply();

    if (s_provisioning) {
        s_dns.processNextRequest();
        if (s_reboot_at && millis() >= s_reboot_at) ESP.restart();
        return;
    }

    const unsigned long now = millis();

    /* mDNS requires regular update() calls on ESP8266. */
    if (now - s_last_mdns >= MDNS_TICK_MS) {
        s_last_mdns = now;
        MDNS.update();
    }

    /* Command watchdog — disarm and stop if no message within WATCHDOG_MS.
     * Matches the S3's ctrl_drive watchdog behaviour. */
    if (!s_watchdog_fired && (now - s_last_command > WATCHDOG_MS)) {
        s_armed          = false;
        s_watchdog_fired = true;
        hardStop();
        ledBlink(LedPattern::DOUBLE_BLINK);   /* distinctive error pattern */
        Serial.println("Watchdog: no command — disarmed and stopped");
    }

    /* Motor ramp tick. */
    if (now - s_last_motor >= MOTOR_TICK_MS) {
        s_last_motor = now;
        motorTick(s_left);
        motorTick(s_right);
    }

    /* Telemetry broadcast. */
    if (now - s_last_telem >= TELEMETRY_MS) {
        s_last_telem = now;
        broadcastTelemetry();
    }

    /* Periodic WS cleanup — frees memory from stale connections. */
    if (now - s_last_cleanup >= CLEANUP_MS) {
        s_last_cleanup = now;
        s_ws.cleanupClients();
    }
}
